{"post_id":"1251487543001354","storyId":"UzpfSTEwMDA0NDIwMzYxMDcyNDoxMjUxNDg3NTQzMDAxMzU0OjEyNTE0ODc1NDMwMDEzNTQ=","content":"Whether you occasionally get backed up and find it hard to have a bowel movement or you suffer with chronic constipation, celery juice is a truly incredible healing remedy that's here for you. But first it's important to understand what causes constipation so you know what is going on inside the body, and so you can understand why celery juice is such an important healing tool. \n\nIn Medical Medium Celery Juice: The Most Powerful Medicine of Our Time Healing Millions Worldwide, I share the true causes of constipation and almost 200 other symptoms and conditions that so many people are experiencing today. I also share how celery juice helps someone with any of these conditions. \n\nEven if you've never experienced constipation, it's highly likely someone you care about has and they need to know the truth and how they can start healing. With the information I share in Medical Medium Celery Juice, you can help them, whether it's a child or adult.\n\nHow Celery Juice Helps Constipation\n\n\"The digestive enzymes alone in celery juice can help break down food in the small intestinal tract and get your system moving when you’re having an off day and feeling backed up. Celery juice is also there to assist when constipation is more of a chronic problem.\n\nMost people who are dealing with constipation are dealing with a sluggish, stagnant liver. When this happens with younger folks, it could be because you came into this life with a liver burdened with toxins passed down from your ancestors. If you’re older, a sluggish liver could have been building for decades. Maybe you, too, started life with a compromised liver, and then a lifetime of eating the type of high-fat diet we’re conditioned to consume put the liver on overload. An overburdened, weakened liver results in lower bile production, and bile is critical for digesting the fats in our diets. When bile diminishes, fats don’t break down or disperse as they should, and they end up going rancid in our guts, feeding colonies of unproductive bacteria.\n\nAnother way digestion can get interrupted is when hydrochloric acid weakens in the stomach. (Find out more about the complex seven-acid blend that your stomach produces in Liver Rescue: Answers to Eczema, Psoriasis, Diabetes, Strep, Acne, Gout, Bloating, Gallstones, Adrenal Stress, Fatigue, Fatty Liver, Weight Issues, SIBO & Autoimmune Disease.) If the stomach glands are forced to overproduce hydrochloric acid over the years to compensate for a damaged or weakened liver, they’ll eventually lose strength, and the resulting lower levels of gastric juices mean that proteins will not break down properly, regardless of whether those are plant- or animal-based proteins. Those proteins will rot in the gut and, again, feed colonies of unproductive bacteria.\n\nWhen unproductive bacteria proliferate in the digestive tract, inflammation occurs and peristaltic action starts to minimize. “Hot spots” can develop in the small intestinal tract and colon; that is, places where pockets of bacteria develop or a narrowing occurs, causing more constipation over time. So many people with constipation these days get diagnosed with small intestinal bacterial overgrowth (SIBO), especially in the alternative medicine world. Medical research and science are unaware that the leading type of bacteria in SIBO is Streptococcus and that there are dozens of strep varieties that are not yet identified.\n\nThe sodium cluster salts in celery juice are the ultimate pathogen destroyers. They immediately start destroying colonies of unproductive bacteria, including strep, making celery juice a critical remedy for constipation (and SIBO). Unlike how strep can become resistant to antibiotics, strep can’t become immune to the cluster salts in celery juice. They keep working. As you read in the previous chapter, this in turn keeps feeding beneficial bacteria in the gut.\n\nCelery juice also revitalizes a sluggish, stagnant liver so that bile production is replenished. It revives the stomach glands, too, so that hydrochloric acid production can be restored: the stomach glands that produce hydrochloric acid find trace minerals specifically in celery juice that feed their tissue.\n\nSometimes constipation is a result of kinks in the small intestinal tract or colon. These are not obstructions; rather, weakened connective tissue around the intestines can create a gentle kinking that makes it difficult for somebody to have a bowel movement. Often this is also the result of a toxic liver—the connective tissue around the intestines has weakened because it’s become saturated with toxins, bacteria, and viruses that the liver has become too overburdened to filter. These troublemakers also end up inside the intestinal tract. Food choice can contribute, too. Some people need more peristalsis-related food if they aren’t getting enough fiber. An easy remedy for many is adding a little more plant-based food to the diet overall. Celery juice is also an amazing peristaltic contributor. (That’s true even though it doesn’t have fiber—to help clear up any confusion over fiber, see “The Fiber Question” in Chapter 4 and also visit Chapter 7, “Rumors, Concerns, and Myths.”) Celery juice naturally triggers peristaltic action; if someone’s not getting enough fiber in their everyday diet, celery juice can stimulate peristalsis to move food along through the intestines. Further, celery juice can help with kinks in the small intestinal tract and colon by reestablishing the intestines’ inner linings and rejuvenating connective tissue around them.\n\nAnd then there’s emotional constipation. Holding in too long or going through emotional struggles, worries, stress, hardships, and betrayals can create internal tension and unrest that leads to constipation. In these situations, celery juice helps the brain greatly. Its intense electrolyte power reestablishes neurotransmitter chemicals, essentially relaxing and cooling down the mind and brain. When its sodium cluster salts enter into neurons and feed them, it can alter someone’s state of being, ultimately leading to peristaltic action.\"\n\nFor more healing information and the true causes of almost 200 other symptoms and conditions, get your copy of Medical Medium Celery Juice now.\n\nLearn more about how to heal from the New York Times bestselling book Cleanse To Heal.","url":"https://www.facebook.com/medicalmedium/posts/pfbid02J3GjZzn3B4pg9XtBb8DfPDAyCVjREx75YqbxrsSXkvyCZQykiHjtGw27MnitUapGl","feedbackId":"ZmVlZGJhY2s6MTI1MTQ4NzU0MzAwMTM1NA==","reactionsCount":0,"shareCount":0,"commentCount":0,"author":{"id":"100044203610724","name":"Medical Medium","avatar":"https://scontent-mia3-2.xx.fbcdn.net/v/t39.30808-1/464708423_3329921377143017_1581797844988372747_n.jpg?stp=cp0_dst-jpg_s80x80_tt6&_nc_cat=103&ccb=1-7&_nc_sid=2d3e12&_nc_ohc=QnxlC6KJSlUQ7kNvwE1R1ea&_nc_oc=AdnBM1989bDIQvWhPmDbXWLP2EYIn29FfZVjrE68aWDzn4ZvtvHmFGfXqPfKMK70sPk&_nc_zt=24&_nc_ht=scontent-mia3-2.xx&_nc_gid=R2s4YmczY3lkahdfP8RJxA&oh=00_AfOQl4WtpkINPdMPWqbfEHlA3RnuqLLF_AweJoBkpyxTNw&oe=684CBDE2","profile":"https://www.facebook.com/medicalmedium"},"createdAt":1749481232,"comments":[],"attachedStoryAttachments":null,"attachmentsDetails":[],"_attachments":[],"collectionId":"100044203610724","folderNames":"Medical Medium"}